flipHand Method
 The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool flipHand()
  Visual Basic
Public Function flipHand As Boolean
  Visual C++
public:
bool flipHand()
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →